[
	{
		"text": "LinkedIn reach is so dead. Is it just me or is it happening with everyone? You spend hours crafting a post, hit 'post' with excitement… and then? 2 likes. One from your best friend, the other from a bot trying to sell you an online course.\n\nMeanwhile, someone posts 'Good morning, LinkedIn' with a stock image of a sunrise or even better (club/vacation images) and boom - 5,000 likes, 200 comments, and a TED Talk invite.\n\nTime to start posting party pictures here!",
        "engagement": 589
	},
	{	
		"text": "There are always 2 sides to a coin. (Please read)\n\nI come from a small town in UP, and today, I want to talk about something that has been on my mind for a long time.\n\nGrowing up, I saw domestic abuse cases all around me. A woman earning alone while her husband drank and beat her. Neighbors watching in silence, dismissing it with: 'Inke ghar ka maamla hai, khud solve karne do!'\n\nNobody helped. Nobody spoke up. And as a young girl, it made me angry. That anger turned into deep resentment. I saw only one side of the coin - women suffering, men being the cause of that suffering.\n\nBut life has a way of showing you perspectives you never imagined.\n\nWhen I moved to Hyderabad, something happened that shook me.\n\nA friend of mine had a heated argument with a man over a completely unrelated issue. Suddenly, out of nowhere, that man's wife jumped in and yelled, 'How dare you abuse a woman?'\n\nMy friend hadn’t even spoken to her. Yet, in an instant, she flipped the narrative, playing the victim, twisting reality in her favor.\n\n'Isne mujhe gaali di!' she screamed in public.\n\nAnd that was the first time I saw the infamous *woman card* being used right in front of me.\n\nI had spent my whole life believing women were always the victims. That men were always at fault. But here I was, witnessing the other side of the coin - where gender could be used as a weapon, where truth could be manipulated to gain sympathy and power.\n\nAnd this made me reflect:\n\nNot every woman is a victim. Not every man is a villain.\n\nThe real problem isn’t men vs. women. The real problem is *abuse of power* - whether it's a man beating his wife behind closed doors or a woman using her gender to falsely accuse an innocent man.\n\nJustice should not depend on gender. *Truth should.*\n\nI have seen both sides of the coin now. And honestly, it scares me. Because in this battle of narratives, the real victims - whether men or women - often remain unheard.\n\nIt’s time we stop looking at things in black and white. It’s time we seek the truth, even when it’s uncomfortable.",
        "engagement": 282
	},
	{
		"text": "To the woman reading this:\n\nYou don’t need to be perfect.\nYou don’t have to 'do it all.'\nYou are enough - just as you are.\n\nYou are more than your productivity. More than your achievements. More than the expectations placed upon you.\n\nNot every woman is 'breaking barriers.'\nSome are just trying to survive.\n\nThe woman hiding her tears at work because 'strong women don’t cry.'\nThe mother battling guilt, whether she chooses career or family.\nThe woman exhausted from proving she’s enough - at home, at work, everywhere.\n\nThis Women’s Day, let’s celebrate all women. Not just the CEOs, the record-breakers, the fighters -\n\nBut also the quiet warriors. The ones battling self-doubt. The ones carrying invisible burdens.\n\nBecause womanhood isn’t about being 'unstoppable' -\n\nIt’s about being human.\n\nThis Women’s Day, I hope you find peace. I hope you find love.\n\nAnd that should be enough.\nBut most of all - I hope you find yourself.\n\nBecause you deserve it.",
        "engagement": 57
	},
	{
		"text": "Gen Z doesn’t want to work? Or do companies just not want to pay?\n\nBoomers: 'Back in my day, we worked 14 hours for ₹2,000 a month!'\nGen Z: 'Okay, that’s tragic. Not a flex.'\n\nSomewhere along the way, we confused hustle with exploitation.\n\nHere’s a wild idea:\n\nMaybe freshers deserve to be paid.\nMaybe passion doesn’t mean working weekends for free.\nMaybe 'work-life balance' shouldn’t be something you earn after burning out.\n\nIf you want experience, offer mentorship.\nIf you want free work, hire interns - and PAY them.\n\nBecause Gen Z isn’t 'lazy.'\nThey just know that exposure doesn’t pay rent.",
        "engagement": 714
	},
	{
		"text": "I don't believe in regrets.\n\nI read something a while ago that changed my perception.\n\nI don't like calling it 'regrets' anymore, I'd like to call it 'wonderings'.\n\nDo you know why?\n\nBecause you always wonder what would have happened if things had played out differently.\n\nBut to name the past decisions as 'regrets' or 'mistakes' is bad.\n\nIf you chose something, at that time it might have been your best choice.\n\nWe never make mistakes purposefully; we only call them that in hindsight.\n\nSo, stop calling them 'regrets' and maybe start calling them 'wonderings'.",
        "engagement": 97
	},
	{
		"text": "My ex has booked a mentorship call with me on Topmate.\n\n100/100 for creativity and efforts.\n\n0/100 for cheating.\n\nNow the real question is - should I:\n\nTreat it like a corporate exit interview and ask, 'Where did we go wrong?'\n\nStart the session with 'So tell me about your weaknesses.'\n\nGive generic career advice but charge an emotional damage tax.\n\nOffer relationship coaching - special discounts for repeat mistakes.\n\nWhat do you guys think? Should I mentor or ghost?",
        "engagement": 89
	},
	{
		"text": "You were not 'let go.' You were strategically removed.\n\nCompanies don’t always fire you. Sometimes, they make you fire yourself.\n\nHere’s how silent layoffs work:\n\nYour workload doubles → But your salary stays the same.\n\nYour manager stops responding → Making it impossible to succeed.\n\nYour growth path vanishes → Promotions? Raises? Forget it.\n\nYour role suddenly feels redundant → But there’s no official layoff.\n\nAnd then one day, you quit out of frustration.\n\nMission accomplished. One less employee to pay severance.\n\nIf this is happening to you:\n\nStart documenting everything.\n\nLook for new roles before quitting.\n\nDon’t take it personally. It’s not you. It’s them.",
        "engagement": 150
	},
	{
		"text": "What if job rejections came with real feedback?\n\nHR: 'We found a better candidate.'\nReality: 'Our CEO's nephew applied.'\n\nHR: 'We’re looking for someone with more experience.'\nReality: 'We wanted someone cheaper.'\n\nHR: 'You were a great fit, but we went another way.'\nReality: 'We don’t know what we want.'\n\nHonest feedback would save us all time.",
        "engagement": 260
	},
	{
		"text": "A Congress minister once said, 'When you are getting raped, lie down and enjoy it.'\n\nNo arrest. No nationwide outrage. No calls for justice.\n\nBut today, people are demanding Ranveer’s arrest for an incest joke on a comedy show.\n\nSo let’s get this straight:\nA politician normalizing rape? Silence.\nA comedian making an inappropriate joke? Immediate outrage.\n\nDon't think that I have sympathy for Ranveer, I have an issue with the prioritization of problems.\n\nAs women, we are told to stay silent when we are molested by family members.\n\n'Don’t ruin the family name.'\n'Who will marry you if this comes out?'\n'It happens in every house. Adjust.'\n\nWe are expected to endure domestic abuse because:\n'Shaadi mein compromise toh karna padta hai.'\n'Ghar ki baat ghar mein rakhni chahiye.'\n'Aurat hi ghar banati hai.'\n\nBut when a joke is made, suddenly, morality awakens.\nSuddenly, people care about what is offensive and inappropriate.\n\nWhere was this outrage when:\n- Marital rape is still not criminalized?\n- Domestic violence cases are dismissed as 'ghar ka maamla'?\n- Women reporting harassment are shamed instead of believed?\n\nThis isn’t about defending a joke. This is about society’s hypocrisy - where outrage is selective, and power decides whose voice matters.\n\nIf we put even half the energy we do into canceling celebrities into holding real abusers accountable, maybe this country would be safer for women.\n\nBut no, it's easier to be offended by words than by the system that allows real violence to continue.",
        "engagement": 187
	},
	{
		"text": "Has anyone tried any astrology apps for asking questions?\n\nI did.\n\nI asked some very specific questions and every astrologer on that app gave me very different answers for the same.\n\nI learned it very early that most of the people on the app are probably scamming you.\n\nOne of my friends spent more than 1 Lakh on the same app, trying to find answers to his questions.\n\nWhen I see the ads of some of these apps, I realise that they're actually trying to trigger you and make you feel vulnerable.\n\n'Will my ex come back?'\n'Will I get a job this year?'\n'Does my crush love me?'\n\n.....\n\nAstrology is real but some of the 'astrologers' on this app aren't real, they're here to scam.\n\nBe aware!",
        "engagement": 78
	},
    {
		"text": "If I want, I can get a mobile phone, all kinds of junk stuff, etc. in 10 mins today.\n\nBut if I need basic healthcare, like consulting a doctor, I have to call 20 clinics, wait for a response, and if it’s a Sunday, I better be ready for more delays.\n\nThis happened to me in Hyderabad, a well-developed city.\n\nIn a well-developed city like Hyderabad, where convenience is at its peak for consumer products, basic healthcare still requires unnecessary struggle - long wait times, endless calls, and uncertainty, especially on weekends.\n\nFrom the place where I come from, it's going to be a long long route.\n\nThe real question is: Why is convenience prioritized for things we want, but not for things we need?\n\nWe’ve optimized convenience for things we want - instant food, quick deliveries, and shopping at our fingertips.\nBut for things we need - healthcare, education, and emergency services - the struggle is real.\n\nWhy is it easier to order a burger than to book a doctor’s appointment?\n\nEven after going through all of the endless process of calling doctors and fixing an appointment, I still have to wait because as usual the doctor isn't there yet.\n\nWhat are we really prioritizing as a society?\n\nP.s - This is not about the place but about the priorities.\n\nI love Hyderabad as a city, so don't start that Hyderabad fight with me!",
        "engagement": 94
	}
]